In [18]:
import mysql.connector
import pandas as pd

In [24]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

In [25]:
#Tạo VIEW hiển thị tên khách hàng và tổng tiền đã chi.
query = """
Create view customer_total_spent as
Select c.name, sum(o.total) as total_spent
from customers c
join orders o on c.id = o.customer_id
group by c.id;
"""
try:
    cursor.execute(query)
    connection.commit()
    connection.close()
    cursor.close()
except mysql.connector.Error as err:
    print(f"Error: {err}")

Error: 1050 (42S01): Table 'customer_total_spent' already exists

In [21]:

df = pd.read_sql_query('Select * from customer_total_spent', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\932149717.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from customer_total_spent', connection)

    name  total_spent
0  Alice        800.0
1    Bob      12000.0

In [22]:
#. Tạo VIEW danh sách sản phẩm có giá trên 100
query = """   
create view products_above_100 as
select * from products where price > 100;
"""
try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

Error: 1050 (42S01): Table 'products_above_100' already exists

In [28]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()
df = pd.read_sql_query('Select * from products_above_100', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\4189619024.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from products_above_100', connection)

   id     name   price
0   1   Laptop  1500.0
1   4  Monitor   300.0

In [29]:
connection.close()
cursor.close()

True

In [30]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

#Tạo VIEW hiển thị các đơn hàng có tổng tiền trên 1000, kèm tên khách hàng.
query  = """  
create view orders_above_1000 as
Select c.name, sum(o.total) as total_spent
from customers c
join orders o on c.id = o.customer_id
group by c.id
having total_spent > 1000;
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [31]:
df = pd.read_sql_query('Select * from orders_above_1000', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\3795042144.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from orders_above_1000', connection)

  name  total_spent
0  Bob      12000.0

In [32]:
connection.close()
cursor.close()

True

In [34]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

#Tạo VIEW hiển thị thông tin nhân viên thuộc phòng "Sales".
query = """  
Create view sales_employees as
select * from employees where department = 'Sales';
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [35]:
df = pd.read_sql_query('Select * from sales_employees', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\1874495537.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from sales_employees', connection)

   id   name department
0   1  David      Sales
1   3  Frank      Sales

In [36]:
connection.close()
cursor.close()

True

In [38]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

#Tạo VIEW cho bảng order_items hiển thị thêm tổng tiền = price × quantity.
query = """  
create view order_items_total_price as
select oi.*, p.price * oi.quantity as total_price
from order_items oi
join products p on oi.product_id = p.id;
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [39]:
df = pd.read_sql_query('Select * from order_items_total_price', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\3736434640.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from order_items_total_price', connection)

   id  order_id  product_id  quantity  total_price
0   3         2           1         1       1500.0
1   4         2           4         1        300.0
2   5         3           1         1       1500.0

In [40]:
connection.close()
cursor.close()

True

In [41]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

query = """  
drop view if exists products_above_100;
"""
try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [43]:
query = """ select * from products_above_100;"""
try:
    cursor.execute(query)
except mysql.connector.Error as err:
    print(f"Error: {err}")

Error: 1146 (42S02): Table 'aio.week.10.products_above_100' doesn't exist

In [53]:
#Tạo VIEW kết hợp nhiều bảng: khách hàng, đơn hàng và nhân viên xử lý đơn hàng.
query = """  
create view customer_order_employee as
Select  
c.name as customer_name,
c.city as customer_city,
o.order_date as order_date,
o.total as order_total,
e.name as employee_name,
e.department as employee_department
from customers c
left join orders o on c.id = o.customer_id
left join order_assignments oa on o.id = oa.order_id
left join employees e on oa.employee_id = e.id;
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [54]:
df = pd.read_sql_query('Select * from customer_order_employee', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\1106505229.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from customer_order_employee', connection)

,customer_name,customer_city,order_date,order_total,employee_name,employee_department
0,Alice,HaNoi,2024-03-01,800.0,Frank,Sales
1,Bob,New York,2024-02-20,12000.0,Emma,Support
2,Charlie,Hanoi,NaT,NaN,None,None

In [72]:
#Tạo VIEW thống kê số lượng sản phẩm được bán theo từng loại sản phẩm.
query = """  
create view product_sales_count as
select p.id as product_id, p.name as product_name, COALESCE(SUM(oi.quantity), 0) AS total_quantity
from products p
left join order_items oi on p.id = oi.product_id
group by p.id, p.name;
"""
try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [75]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

df = pd.read_sql_query('Select * from product_sales_count', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\4032028030.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from product_sales_count', connection)

   product_id product_name  total_quantity
0           1       Laptop             2.0
1           2        Mouse             0.0
2           3     Keyboard             0.0
3           4      Monitor             1.0

In [77]:
#Tạo VIEW chỉ cho phép xem các đơn hàng của khách hàng từ thành phố "Hanoi".
query = """  
Create view hanoi_customer as
select o.id as order_id, o.order_date as order_date, o.total as order_total, c.name as customer_name, c.city as customer_city
from orders o
join customers c on o.customer_id = c.id
where c.city = 'Hanoi';
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [78]:
df = pd.read_sql_query('Select * from hanoi_customer', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\1485456107.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from hanoi_customer', connection)

   order_id order_date  order_total customer_name customer_city
0         2 2024-03-01        800.0         Alice         HaNoi

In [79]:
connection.close()
cursor.close()

True

In [83]:
#Connect to database
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="123#edc",
    database="aio.week.10"
)

cursor = connection.cursor()

# Tạo VIEW giúp kế toán xem đơn hàng gồm: order_id, customer name,total.
query = """  
create view accounting_orders as
select o.id as order_id, c.name as customer_name, o.total as order_total
from orders o
right join customers c on o.customer_id = c.id;
"""

try:
    cursor.execute(query)
    connection.commit()
except mysql.connector.Error as err:
    print(f"Error: {err}")

In [84]:
df = pd.read_sql_query('Select * from accounting_orders', connection)
df.head()

C:\Users\AI LEARNER\AppData\Local\Temp\ipykernel_7348\4270541146.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('Select * from accounting_orders', connection)

   order_id customer_name  order_total
0       2.0         Alice        800.0
1       3.0           Bob      12000.0
2       NaN       Charlie          NaN